# language: ru
# encoding: utf-8

@tree
@IgnoreOnCIMainBuild


Функциональность: ДляПроверкиЦиклов14
 
Сценарий: ДляПроверкиЦиклов14

	//Нужно несколько шагов, чтобы id был больше одной цифры
	И Я запоминаю значение выражения '0' в переменную "Счетчик"
	И Я запоминаю значение выражения '0' в переменную "Счетчик"
	И Я запоминаю значение выражения '0' в переменную "Счетчик"
	И Я запоминаю значение выражения '0' в переменную "Счетчик"
	И Я запоминаю значение выражения '0' в переменную "Счетчик"
	И Я запоминаю значение выражения '0' в переменную "Счетчик"
	И Я запоминаю значение выражения '0' в переменную "Счетчик"
	И Я запоминаю значение выражения '0' в переменную "Счетчик"
	И Я запоминаю значение выражения '0' в переменную "Счетчик"
	И Я запоминаю значение выражения '0' в переменную "Счетчик"
	И Я запоминаю значение выражения '0' в переменную "Счетчик"
	
	И для каждой строки макета "ДляПроверкиЦиклов14_Макет" я выполняю
		И я вывожу значение переменной "Счетчик"
		
		И пауза 0.1
	
		
