# language: ru
# encoding: utf-8

@IgnoreOnCIMainBuild
@tree


Функциональность: ЗагрузкаПараметровИзКоманднойСтроки01



Сценарий: ЗагрузкаПараметровИзКоманднойСтроки01
	И Я запоминаю значение выражения '1' в переменную "ИмяПеременной"
	
	И я вывожу значение переменной "ИмяПеременной"
	И Пауза 1

	И Я запоминаю значение выражения '$ИмяПеременной$ + 1' в переменную "ИмяПеременной"
	И я вывожу значение переменной "ИмяПеременной"
	И Пауза 1
	
	И Я запоминаю значение выражения '$ИмяПеременной$ + 1' в переменную "ИмяПеременной"
	И я вывожу значение переменной "ИмяПеременной"
	И Пауза 1
	
	И Я запоминаю значение выражения '$ИмяПеременной$ + 1' в переменную "ИмяПеременной"
	И я вывожу значение переменной "ИмяПеременной"
	И Пауза 1
	
	И Я запоминаю значение выражения '$ИмяПеременной$ + 1' в переменную "ИмяПеременной"
	И я вывожу значение переменной "ИмяПеременной"
	И Пауза 1
	
	И Я запоминаю значение выражения '$ИмяПеременной$ + 1' в переменную "ИмяПеременной"
	И я вывожу значение переменной "ИмяПеременной"
	И Пауза 1
	
	И Я запоминаю значение выражения '$ИмяПеременной$ + 1' в переменную "ИмяПеременной"
	И я вывожу значение переменной "ИмяПеременной"
	И Пауза 1
	
	И Я запоминаю значение выражения '$ИмяПеременной$ + 1' в переменную "ИмяПеременной"
	И я вывожу значение переменной "ИмяПеременной"
	И Пауза 1
	
	И Я запоминаю значение выражения '$ИмяПеременной$ + 1' в переменную "ИмяПеременной"
	И я вывожу значение переменной "ИмяПеременной"
	И Пауза 1
	
	И Я запоминаю значение выражения '$ИмяПеременной$ + 1' в переменную "ИмяПеременной"
	И я вывожу значение переменной "ИмяПеременной"
	И Пауза 1
	
	И Я запоминаю значение выражения '$ИмяПеременной$ + 1' в переменную "ИмяПеременной"
	И я вывожу значение переменной "ИмяПеременной"
	И Пауза 1
	
	И Я запоминаю значение выражения '$ИмяПеременной$ + 1' в переменную "ИмяПеременной"
	И я вывожу значение переменной "ИмяПеременной"
	И Пауза 1
	
	И Я запоминаю значение выражения '$ИмяПеременной$ + 1' в переменную "ИмяПеременной"
	И я вывожу значение переменной "ИмяПеременной"
	И Пауза 1
	
	И Я запоминаю значение выражения '$ИмяПеременной$ + 1' в переменную "ИмяПеременной"
	И я вывожу значение переменной "ИмяПеременной"
	И Пауза 1
	
	И Я запоминаю значение выражения '$ИмяПеременной$ + 1' в переменную "ИмяПеременной"
	И я вывожу значение переменной "ИмяПеременной"
	И Пауза 1
	
	И Я запоминаю значение выражения '$ИмяПеременной$ + 1' в переменную "ИмяПеременной"
	И я вывожу значение переменной "ИмяПеременной"
	И Пауза 1
	
	И Я запоминаю значение выражения '$ИмяПеременной$ + 1' в переменную "ИмяПеременной"
	И я вывожу значение переменной "ИмяПеременной"
	И Пауза 1
	
	И Я запоминаю значение выражения '$ИмяПеременной$ + 1' в переменную "ИмяПеременной"
	И я вывожу значение переменной "ИмяПеременной"
	И Пауза 1
	
	И Я запоминаю значение выражения '$ИмяПеременной$ + 1' в переменную "ИмяПеременной"
	И я вывожу значение переменной "ИмяПеременной"
	И Пауза 1
	
	И Я запоминаю значение выражения '$ИмяПеременной$ + 1' в переменную "ИмяПеременной"
	И я вывожу значение переменной "ИмяПеременной"
	И Пауза 1
	
	И Я запоминаю значение выражения '$ИмяПеременной$ + 1' в переменную "ИмяПеременной"
	И я вывожу значение переменной "ИмяПеременной"
	И Пауза 1
	
	И Я запоминаю значение выражения '$ИмяПеременной$ + 1' в переменную "ИмяПеременной"
	И я вывожу значение переменной "ИмяПеременной"
	И Пауза 1
	
	И Я запоминаю значение выражения '$ИмяПеременной$ + 1' в переменную "ИмяПеременной"
	И я вывожу значение переменной "ИмяПеременной"
	И Пауза 1
	
