# language: ru
# encoding: utf-8

@IgnoreOnCIMainBuild
@tree


Функциональность: ОзвучкаВыполненияСценария01

Сценарий: ОзвучкаВыполненияСценария01
	* И достаточно длинный текст один
		И Я запоминаю значение выражения '1' в переменную "ИмяПеременной"
		И Я запоминаю значение выражения '1' в переменную "ИмяПеременной"
		И Я запоминаю значение выражения '1' в переменную "ИмяПеременной"
		И Я запоминаю значение выражения '1' в переменную "ИмяПеременной"
		И пауза 10


	* И достаточно длинный текст два
		И Я запоминаю значение выражения '1' в переменную "ИмяПеременной"
		И Я запоминаю значение выражения '1' в переменную "ИмяПеременной"
		И Я запоминаю значение выражения '1' в переменную "ИмяПеременной"
		И Я запоминаю значение выражения '1' в переменную "ИмяПеременной"
		И пауза 10


