# language: ru
# encoding: utf-8

@IgnoreOnCIMainBuild


Функциональность: ФичаДляПроверкиОтчетаAllure22
 

Сценарий: Сценарий01
	И Я запоминаю значение выражения '1+1' в переменную "ИмяПеременной1"
	Затем я останавливаю выполнение всех сценариев
	И Я запоминаю значение выражения '2+2' в переменную "ИмяПеременной2"
	
Сценарий: Сценарий02
	И Я запоминаю значение выражения '1+1' в переменную "ИмяПеременной1"
	Затем я останавливаю выполнение всех сценариев
	И Я запоминаю значение выражения '2+2' в переменную "ИмяПеременной2"
