# language: ru
# encoding: utf-8


@tree
@IgnoreOnCIMainBuild


Функционал: Тестовая фича, проверяющая работу флага ОстановкаПриВозникновенииОшибки03
 

Сценарий: Тестовая фича, проверяющая работу флага ОстановкаПриВозникновенииОшибки03_1

	И Я запоминаю значение выражения '1' в переменную "ИмяПеременной"
	И Я запоминаю значение выражения '2' в переменную "ИмяПеременной"
	И такого шага нет в библиотеке шагов


Сценарий: Тестовая фича, проверяющая работу флага ОстановкаПриВозникновенииОшибки03_2

	И Я запоминаю значение выражения '3' в переменную "ИмяПеременной"
	И Я запоминаю значение выражения '4' в переменную "ИмяПеременной"