# language: ru
# encoding: utf-8

@IgnoreOnCIMainBuild
@tree


Функциональность: ПовторыйЗапускТестов04

Сценарий: Сценарий1ПовторыйЗапускТестов04
	И Я запоминаю значение выражения '1' в переменную "ИмяПеременной"
	
Сценарий: Сценарий2ПовторыйЗапускТестов04
	И Я запоминаю значение выражения '1' в переменную "ИмяПеременной"
	
Сценарий: Сценарий3ПовторыйЗапускТестов04
	И Я запоминаю значение выражения '1' в переменную "ИмяПеременной"
	
Сценарий: Сценарий4ПовторыйЗапускТестов04
	И Я запоминаю значение выражения '1' в переменную "ИмяПеременной"
	
Сценарий: Сценарий5ПовторыйЗапускТестов04
	И Я запоминаю значение выражения '1' в переменную "ИмяПеременной"
	





