# language: ru
# encoding: utf-8

@IgnoreOnCIMainBuild


Функциональность: VAEditor03
 

Сценарий: VAEditor03 - 01

	И Я запоминаю значение выражения '1+1' в переменную "ИмяПеременной1"
	Тогда я вызываю исключение "Текст исключения1"
	

Сценарий: VAEditor03 - 02

	И Я запоминаю значение выражения '1+1' в переменную "ИмяПеременной1"
	Тогда я вызываю исключение "Текст исключения2"
	
Сценарий: VAEditor03 - 03

	И Я запоминаю значение выражения '1+1' в переменную "ИмяПеременной1"
	Тогда я вызываю исключение "Текст исключения3"
	

Сценарий: VAEditor03 - 04

	И Я запоминаю значение выражения '1+1' в переменную "ИмяПеременной1"
	Тогда я вызываю исключение "Текст исключения4"
	
