#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьОбработку(Команда)
	ОбработкаВыполнена = Ложь;
	ТекстИсключения = "";
	ЗначениеРезультат = "";
	
	Попытка
		Данные = ПолучитьДанныеСервер();
		ЗначениеРезультат = ЗаписатьОбъектJSON(Данные);
	Исключение
		ТекстИсключения = ОписаниеОшибки();
	КонецПопытки;
	
	ОбработкаВыполнена = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПараметры(Команда)
	
	Если НЕ ЗначениеЗаполнено(ДляУстановкиПараметров) Тогда
		Возврат;
	КонецЕсли;
	
	Данные = ПрочитатьОбъектJSON(ДляУстановкиПараметров);
	
	Если Данные.Свойство("ДатаНачала") Тогда
		ДатаНачала = Данные.ДатаНачала;
	КонецЕсли;	
	Если Данные.Свойство("ДатаОкончания") Тогда
		ДатаОкончания = Данные.ДатаОкончания;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПрочитатьОбъектJSON(ДанныеJSON, ПрочитатьВСоответствие = Ложь)
	
	ЧтениеJSON = New ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ДанныеJSON);
	ИменаСвойствСоЗначениямиДата = Новый Массив;
	ИменаСвойствСоЗначениямиДата.Добавить("ДатаНачала");
	ИменаСвойствСоЗначениямиДата.Добавить("ДатаОкончания");
	Значение = ПрочитатьJSON(ЧтениеJSON, ПрочитатьВСоответствие, ИменаСвойствСоЗначениямиДата);
	ЧтениеJSON.Закрыть();
	Возврат Значение;
	
КонецФункции	 

&НаКлиенте
Функция ЗаписатьОбъектJSON(ДанныеJSON) Экспорт
	#Если НЕ ВебКлиент Тогда

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ДанныеJSON);
	Возврат ЗаписьJSON.Закрыть();
	
	#КонецЕсли
КонецФункции

&НаСервере
Функция ПолучитьДанныеСервер()
	
	Результат = Новый Массив;
	
	Если Тип = "Перечисление" Тогда
		ОМ = Метаданные.Перечисления[Вид];
		Для Каждого Элем Из ОМ.ЗначенияПеречисления  Цикл
			ДанныеЗначения = Новый Структура;
			ДанныеЗначения.Вставить("Имя", Элем.Имя);
			ДанныеЗначения.Вставить("Представление", Элем.Синоним);
			Результат.Добавить(ДанныеЗначения);
		КонецЦикла;
	ИначеЕсли Тип = "Справочник" Тогда
		Возврат ПолучитьДанныеСправочника();
	ИначеЕсли Тип = "Документ" Тогда
		Возврат ПолучитьДанныеДокумента();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеСправочника()
	
	Запрос = Новый Запрос;
	
	ИмяСправочника = Вид;
	
	ОМ = Метаданные.Справочники[ИмяСправочника];
	ДлинаКода = ОМ.ДлинаКода;	
	ДлинаНаименования = ОМ.ДлинаНаименования;
	
	Если ДлинаКода > 0 Тогда
		ЕстьКод = Истина;
	Иначе	
		ЕстьКод = Ложь;
	КонецЕсли;
	
	Если ДлинаНаименования > 0 Тогда
		ЕстьНаименование = Истина;
	Иначе	
		ЕстьНаименование = Ложь;
	КонецЕсли;	
	
	СтрокаКоличествоСсылок = " ПЕРВЫЕ " + XMLСтрока(КоличествоСсылок);
	Если КоличествоСсылок = 0 Тогда
		СтрокаКоличествоСсылок = "";
	КонецЕсли;	
	
	ТекстЗапроса = "ВЫБРАТЬ" + СтрокаКоличествоСсылок + "
		|___Таблица___.Ссылка КАК Ссылка,
		|___Таблица___.ПометкаУдаления КАК ПометкаУдаления";
	
	Если ЕстьНаименование Тогда
		ТекстЗапроса = ТекстЗапроса + "," + Символы.ПС + "___Таблица___.Наименование КАК Наименование";
	КонецЕсли;	
	Если ЕстьКод Тогда
		ТекстЗапроса = ТекстЗапроса + "," +  Символы.ПС + "___Таблица___.Код КАК Код";
	КонецЕсли;	
	
	// Добавляем владельца если указан
	Если ЗначениеЗаполнено(ИмяВладельца) ИЛИ ОМ.Владельцы.Количество() Тогда
		ЕстьВладелец = Истина;
		ТекстЗапроса = ТекстЗапроса + ",
		|___Таблица___.Владелец КАК Владелец";
	Иначе	
		ЕстьВладелец = Ложь;
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
		|ИЗ
		|Справочник." + ИмяСправочника + " КАК ___Таблица___";
	
	// Добавляем условие по владельцу
	Если ЗначениеЗаполнено(ИмяВладельца) Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|ГДЕ ___Таблица___.Владелец.Наименование = &Владелец";
		
		Запрос.УстановитьПараметр("Владелец", ИмяВладельца);
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
		|УПОРЯДОЧИТЬ ПО Наименование";
	
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Результат = Новый Массив;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(ВыборкаДетальныеЗаписи.Ссылка);
		Данные = Новый Структура;
		Данные.Вставить("Ссылка", Строка(ВыборкаДетальныеЗаписи.Ссылка));
		Данные.Вставить("НавигационнаяСсылка", НавигационнаяСсылка);
		Данные.Вставить("ПометкаУдаления", ВыборкаДетальныеЗаписи.ПометкаУдаления);
		Если ЕстьНаименование Тогда
			Данные.Вставить("Наименование", ВыборкаДетальныеЗаписи.Наименование);
		КонецЕсли;
		Если ЕстьКод Тогда
			Данные.Вставить("Код", ВыборкаДетальныеЗаписи.Код);
		КонецЕсли;
		Если ЕстьВладелец Тогда
			Данные.Вставить("Владелец", Строка(ВыборкаДетальныеЗаписи.Владелец));
		КонецЕсли;	
		Результат.Добавить(Данные);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции	

&НаСервере
Функция ПолучитьДанныеДокумента()
	
	Запрос = Новый Запрос;
	
	ИмяДокумента = Вид;
	
	ОМ = Метаданные.Документы[ИмяДокумента];
	ДлинаНомера = ОМ.ДлинаНомера;	
	
	Если ДлинаНомера > 0 Тогда
		ЕстьНомер = Истина;
	Иначе	
		ЕстьНомер = Ложь;
	КонецЕсли;
	
	Если ОМ.Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить Тогда
		ЕстьПризнакПроведен = Истина;
	Иначе	
		ЕстьПризнакПроведен = Ложь;
	КонецЕсли;
	
	СтрокаКоличествоСсылок = " ПЕРВЫЕ " + XMLСтрока(КоличествоСсылок);
	Если КоличествоСсылок = 0 Тогда
		СтрокаКоличествоСсылок = "";
	КонецЕсли;	
	
	ТекстЗапроса = "ВЫБРАТЬ" + СтрокаКоличествоСсылок + "
		|___Таблица___.Ссылка КАК Ссылка,
		|___Таблица___.ПометкаУдаления КАК ПометкаУдаления";
	
	ТекстЗапроса = ТекстЗапроса + "," + Символы.ПС + "___Таблица___.Дата КАК Дата";
	Если ЕстьНомер Тогда
		ТекстЗапроса = ТекстЗапроса + "," +  Символы.ПС + "___Таблица___.Номер КАК Номер";
	КонецЕсли;	
	Если ЕстьПризнакПроведен Тогда
		ТекстЗапроса = ТекстЗапроса + "," +  Символы.ПС + "___Таблица___.Проведен КАК Проведен";
	КонецЕсли;	
	
	ТекстЗапроса = ТекстЗапроса + "
		|ИЗ
		|Документ." + ИмяДокумента + " КАК ___Таблица___";
	
	Если ЗначениеЗаполнено(ДатаНачала) И ЗначениеЗаполнено(ДатаОкончания) Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|ГДЕ ___Таблица___.Дата >= &ДатаНачала И ___Таблица___.Дата <= &ДатаОкончания";
		Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
		Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Иначе	
		// Добавляем условие по ДатаНачала
		Если ЗначениеЗаполнено(ДатаНачала) Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|ГДЕ ___Таблица___.Дата >= &ДатаНачала";
			
			Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
		КонецЕсли;
		
		// Добавляем условие по ДатаНачала
		Если ЗначениеЗаполнено(ДатаОкончания) Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|ГДЕ ___Таблица___.Дата <= &ДатаОкончания";
			
			Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
		КонецЕсли;
	КонецЕсли;	
	
	ТекстЗапроса = ТекстЗапроса + "
		|УПОРЯДОЧИТЬ ПО Дата";
	
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Результат = Новый Массив;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(ВыборкаДетальныеЗаписи.Ссылка);
		Данные = Новый Структура;
		Данные.Вставить("Ссылка", Строка(ВыборкаДетальныеЗаписи.Ссылка));
		Данные.Вставить("ПометкаУдаления", ВыборкаДетальныеЗаписи.ПометкаУдаления);
		Данные.Вставить("НавигационнаяСсылка", НавигационнаяСсылка);
		Данные.Вставить("Дата", ВыборкаДетальныеЗаписи.Дата);
		Если ЕстьНомер Тогда
			Данные.Вставить("Номер", ВыборкаДетальныеЗаписи.Номер);
		КонецЕсли;
		Если ЕстьПризнакПроведен Тогда
			Данные.Вставить("Проведен", ВыборкаДетальныеЗаписи.Проведен);
		КонецЕсли;
		Результат.Добавить(Данные);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции	

#КонецОбласти