
&НаКлиенте
Перем МойОбъект;
&НаКлиенте
Перем Ключ;


&НаСервере
Процедура ЗаполнитьТаблицуЯзыков(СписокЯзыковПеревода)
	ТаблицаЯзыковСервер = РеквизитФормыВЗначение("ТаблицаЯзыков");
	ТаблицаЯзыковСервер.Очистить();
	
	
	Для Каждого Элем Из СписокЯзыковПеревода Цикл
		СтрокаТаблицаЯзыковСервер = ТаблицаЯзыковСервер.Добавить();
		СтрокаТаблицаЯзыковСервер.Язык = Элем;
	КонецЦикла;	
	
	ЗначениеВРеквизитФормы(ТаблицаЯзыковСервер,"ТаблицаЯзыков");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФайлВМассив(Файл,Массив)
	Текст = Новый ЧтениеТекста;
	Текст.Открыть(Файл.ПолноеИмя,"UTF-8");
	
	Пока Истина Цикл
		Стр = Текст.ПрочитатьСтроку();
		Если Стр = Неопределено Тогда
			Прервать;
		КонецЕсли;	 
		
		Массив.Добавить(Стр);
	КонецЦикла;	
	
	Текст.Закрыть();
КонецПроцедуры

&НаКлиенте
Функция ПолучитьТекущееЗначениеСекцииСПереводами(Массив,Знач Ном,НачалоСекции,ОкончаниеСекции)
	НачалоСекции = -1;
	Пока Истина Цикл
		Ном = Ном - 1;
		ТекСтр = Массив[Ном];
		
		Если СокрЛП(ТекСтр) = "<Title>" Тогда
			НачалоСекции = Ном;
			Прервать;
		КонецЕсли;	 
		Если СокрЛП(ТекСтр) = "<Synonym>" Тогда
			НачалоСекции = Ном;
			Прервать;
		КонецЕсли;	 
		Если СокрЛП(ТекСтр) = "<ToolTip>" Тогда
			НачалоСекции = Ном;
			Прервать;
		КонецЕсли;	 
		Если СокрЛП(ТекСтр) = "<Presentation>" Тогда
			НачалоСекции = Ном;
			Прервать;
		КонецЕсли;	 
	КонецЦикла;	
	
	МассивСекции = Новый Массив;
	
	Ном = НачалоСекции-1;
	Пока Истина Цикл
		Ном = Ном + 1;
		
		ТекСтр = Массив[Ном];
		МассивСекции.Добавить(ТекСтр);
		
		ОкончаниеСекции = Ном;
		
		Если СокрЛП(ТекСтр) = "</Title>" Тогда
			Прервать;
		КонецЕсли;	 
		Если СокрЛП(ТекСтр) = "</Synonym>" Тогда
			Прервать;
		КонецЕсли;	 
		Если СокрЛП(ТекСтр) = "</ToolTip>" Тогда
			Прервать;
		КонецЕсли;	 
		Если СокрЛП(ТекСтр) = "</Presentation>" Тогда
			Прервать;
		КонецЕсли;	 
	КонецЦикла;	
	
	Возврат МассивСекции;
КонецФункции	

&НаКлиенте
Функция ЯзыкУжеЕстьВСекции(ТекущееЗначениеСекцииСПереводами,ТекЯзык)
	СтрокаПоиска = "<v8:lang>" + ТекЯзык + "</v8:lang>";
	Для Каждого Стр Из ТекущееЗначениеСекцииСПереводами Цикл
		Если СокрЛП(НРег(Стр)) = СтрокаПоиска Тогда
			Возврат Истина;
		КонецЕсли;	 
	КонецЦикла;	
	
	Возврат Ложь;
КонецФункции	

&НаКлиенте
Функция ЗначениеДляПеревода(ТекущееЗначениеСекцииСПереводами,ЗначениеДляПеревода)
	СтрокаПоиска = "<v8:lang>" + БратьДляПеревода + "</v8:lang>";
	
	Ном = -1;
	Для Каждого Стр Из ТекущееЗначениеСекцииСПереводами Цикл
		Ном = Ном + 1;
		Если СокрЛП(НРег(Стр)) = СтрокаПоиска Тогда
			НужнаяСтрока = ТекущееЗначениеСекцииСПереводами[Ном+1];
			НужнаяСтрока = СтрЗаменить(НужнаяСтрока,"<v8:content>","");
			НужнаяСтрока = СтрЗаменить(НужнаяСтрока,"</v8:content>","");
			Возврат СокрЛП(НужнаяСтрока);
		КонецЕсли;	 
	КонецЦикла;	
	
	ВызватьИсключение "Не нашел строку оригинал для перевода по строке поиска <" + СтрокаПоиска + ">. Значение для перевода <" + ЗначениеДляПеревода + ">";
КонецФункции	

&НаКлиенте
Функция ПеревестиВыражение(Текст,Язык1,Язык2)
	НаправлениеПеревода = Язык1 + "-" + Язык2;
	ТекстПеревод = МойОбъект.Translate(Ключ,  НаправлениеПеревода, Текст);
	
	Возврат ТекстПеревод;
КонецФункции	

&НаКлиенте
Процедура ДобавитьПереводВСекцию(Перевод,ТекЯзык,ТекущееЗначениеСекцииСПереводами)
	КолСтрок = ТекущееЗначениеСекцииСПереводами.Количество();
	ТекущееЗначениеСекцииСПереводами.Вставить(КолСтрок-1,"</v8:item>");
	ТекущееЗначениеСекцииСПереводами.Вставить(КолСтрок-1,"<v8:content>" + Перевод + "</v8:content>");
	ТекущееЗначениеСекцииСПереводами.Вставить(КолСтрок-1,"<v8:lang>" + ТекЯзык + "</v8:lang>");
	ТекущееЗначениеСекцииСПереводами.Вставить(КолСтрок-1,"<v8:item>");
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьПереводВСекции(Перевод,ТекЯзык,ТекущееЗначениеСекцииСПереводами)
	СтрокаПоиска = "<v8:lang>" + ТекЯзык + "</v8:lang>";
	
	Ном = -1;
	Для Каждого Стр Из ТекущееЗначениеСекцииСПереводами Цикл
		Ном = Ном + 1;
		Если СокрЛП(НРег(Стр)) = СтрокаПоиска Тогда
			ТекущееЗначениеСекцииСПереводами[Ном+1] = "<v8:content>" + Перевод + "</v8:content>";
			Возврат;
		КонецЕсли;	 
	КонецЦикла;	
	
	ВызватьИсключение "Не смог заменить перевод в секции по строк поиска <" + СтрокаПоиска + ">";
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьСекцию(Массив,НачалоСекции,ТекущееЗначениеСекцииСПереводами)
	//Пока Массив.Количество()-1 >= НачалоСекции Цикл
	//	Массив.Удалить(Массив.Количество()-1);
	//КонецЦикла;	
	
	Ном = Массив.Количество();
	Пока Истина Цикл
		Ном = Ном - 1;
		ТекСтр = СокрЛП(Массив[Ном]);
		
		Массив.Удалить(Ном);
		
		Если ТекСтр = "<Title>" Тогда
			Прервать;
		КонецЕсли;	 
		Если ТекСтр = "<Synonym>" Тогда
			Прервать;
		КонецЕсли;	 
		Если ТекСтр = "<ToolTip>" Тогда
			Прервать;
		КонецЕсли;	 
		Если ТекСтр = "<Presentation>" Тогда
			Прервать;
		КонецЕсли;	 
	КонецЦикла;	
	
	Для Каждого Стр Из ТекущееЗначениеСекцииСПереводами Цикл
		Массив.Добавить(Стр);
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьФайл(Файл)
	Массив = Новый Массив;
	ЗагрузитьФайлВМассив(Файл,Массив);
	
	НовыйМассив = Новый Массив;
	
	НадоОбновитьФайл = Ложь;
	
	СтрокаПоиска = "<v8:lang>" + ПризнакЧтоНадоПереводить + "</v8:lang>";
	Ном = -1;
	Пока Истина Цикл
		Ном = Ном + 1;
		Если Ном > Массив.Количество()-1 Тогда
			Прервать;
		КонецЕсли;	 
		
		Стр = Массив[Ном];
		
		Если СокрЛП(НРег(Стр)) = СтрокаПоиска Тогда
			НачалоСекции    = -1;
			ОкончаниеСекции = -1;
			ТекущееЗначениеСекцииСПереводами = ПолучитьТекущееЗначениеСекцииСПереводами(Массив,Ном,НачалоСекции,ОкончаниеСекции);
			
			ДобавлялиПеревод = Ложь;
			Для Каждого СтрокаТаблицаЯзыков Из ТаблицаЯзыков Цикл
				ТекЯзык = СтрокаТаблицаЯзыков.Язык;
				
				ЯзыкУжеЕстьВСекции = ЯзыкУжеЕстьВСекции(ТекущееЗначениеСекцииСПереводами,ТекЯзык);
				
				ЗначениеДляПеревода = ЗначениеДляПеревода(ТекущееЗначениеСекцииСПереводами,ЗначениеДляПеревода);
				Перевод             = ПеревестиВыражение(ЗначениеДляПеревода,БратьДляПеревода,ТекЯзык);
				
				Если НЕ ЯзыкУжеЕстьВСекции Тогда
					ДобавитьПереводВСекцию(Перевод,ТекЯзык,ТекущееЗначениеСекцииСПереводами);
					ДобавлялиПеревод = Истина;
				Иначе
					ЗаменитьПереводВСекции(Перевод,ТекЯзык,ТекущееЗначениеСекцииСПереводами);
					ДобавлялиПеревод = Истина;
				КонецЕсли;	 
			КонецЦикла;	
			
			Если ДобавлялиПеревод Тогда
				НадоОбновитьФайл = Истина;
				ЗаменитьСекцию(НовыйМассив,НачалоСекции,ТекущееЗначениеСекцииСПереводами);
				Если ОкончаниеСекции < Ном Тогда
					ВызватьИсключение "Ошибка определения секции. ОкончаниеСекции="+ОкончаниеСекции + ", Ном="+Ном;
				КонецЕсли;	 
				
				Ном = ОкончаниеСекции;
				Продолжить;
			КонецЕсли;	 
		КонецЕсли;	 
		
		НовыйМассив.Добавить(Стр);
	КонецЦикла;	
	
	
	Если НЕ НадоОбновитьФайл Тогда
		Возврат;
	КонецЕсли;	 
	
	ВременныйФайл = ПолучитьИмяВременногоФайла("xml");
	ЗТ = Новый ЗаписьТекста(ВременныйФайл,"UTF-8",,Истина); 
	Для Каждого Стр Из НовыйМассив Цикл
		ЗТ.ЗаписатьСтроку(Стр); 
	КонецЦикла;	
	ЗТ.Закрыть();
	
	
	КопироватьФайл(ВременныйФайл,Файл.ПолноеИмя);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПереводПоТаблице(Команда)
	МассивФайлов = НайтиФайлы(КаталогФайлов,"*.xml",Истина);
	
	Для Каждого Файл Из МассивФайлов Цикл
		Сообщить("" + Файл.ПолноеИмя);
		ОбработатьФайл(Файл);
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Функция ВыделитьПолезнуюСтроку(Стр)
	Если Прав(Стр,1) = ";" Тогда
		Стр = Лев(Стр,СтрДлина(Стр)-1);
	КонецЕсли;	 
	
	Если Прав(Стр,1) = ")" Тогда
		Стр = Лев(Стр,СтрДлина(Стр)-1);
	КонецЕсли;	 
	
	Если Прав(Стр,1) = """" Тогда
		Стр = Лев(Стр,СтрДлина(Стр)-1);
	КонецЕсли;	 
	
	Если Лев(Стр,1) = """" Тогда
		Стр = Сред(Стр,2);
	КонецЕсли;	 
	
	Возврат Стр;
КонецФункции	 

&НаКлиенте
Функция ПолучитьСообщениеИзСтроки(Знач Стр)
	ИсходнаяСтрока = Стр;
	
	//Если Лев(НРег(Стр),17) = НРег("СообщениеОшибки =") Тогда
	//	Если Найти(НРег(Стр),НРег("СтрЗаменить")) > 0 Тогда
	//		Возврат Неопределено;
	//	КонецЕсли;	 
	//	
	//	Если Найти(НРег(Стр),НРег("ТекстСообщения + ")) > 0 Тогда
	//		Возврат Неопределено;
	//	КонецЕсли;	 
	//	
	//	Если Найти(НРег(Стр),НРег("+ ТекстСообщения")) > 0 Тогда
	//		Возврат Неопределено;
	//	КонецЕсли;	 
	//	
	//	Если Найти(НРег(Стр),НРег("ТекстСообщения = Вычислить(")) > 0 Тогда
	//		Возврат Неопределено;
	//	КонецЕсли;	 
	//	
	//	Если Найти(НРег(Стр),НРег("ТекстСообщения = Формат")) > 0 Тогда
	//		Возврат Неопределено;
	//	КонецЕсли;	 
	//	
	//	ПромСтр = СокрЛП(Сред(Стр,18));
	//	Если Лев(ПромСтр,1) <> """" Тогда
	//		Возврат Неопределено;
	//	КонецЕсли;	 
	//	
	//	Стр = Сред(Стр,18);
	//	
	//	Стр = ВыделитьПолезнуюСтроку(Стр);
	//	Возврат Стр;
	Если Лев(НРег(Стр),52) = НРег("ТекстСообщения = ПолучитьТекстСообщенияПользователю(") Тогда
		Если Найти(НРег(Стр),НРег("СтрЗаменить")) > 0 Тогда
			Возврат Неопределено;
		КонецЕсли;	 
		
		Если Найти(НРег(Стр),НРег("ТекстСообщения + ")) > 0 Тогда
			Возврат Неопределено;
		КонецЕсли;	 
		
		Если Найти(НРег(Стр),НРег("+ ТекстСообщения")) > 0 Тогда
			Возврат Неопределено;
		КонецЕсли;	 
		
		Если Найти(НРег(Стр),НРег("ТекстСообщения = Вычислить(")) > 0 Тогда
			Возврат Неопределено;
		КонецЕсли;	 
		
		Если Найти(НРег(Стр),НРег("ТекстСообщения = Формат")) > 0 Тогда
			Возврат Неопределено;
		КонецЕсли;	 
		
		ПромСтр = СокрЛП(Сред(Стр,53));
		Если Лев(ПромСтр,1) <> """" Тогда
			Возврат Неопределено;
		КонецЕсли;	 
		
		
		Стр = Сред(Стр,53);
		
		Стр = ВыделитьПолезнуюСтроку(Стр);
		Возврат Стр;
	ИначеЕсли Лев(НРег(Стр),60) = НРег("ТекстСообщения = Ванесса.ПолучитьТекстСообщенияПользователю(") Тогда
		Если Найти(НРег(Стр),НРег("СтрЗаменить")) > 0 Тогда
			Возврат Неопределено;
		КонецЕсли;	 
		
		Если Найти(НРег(Стр),НРег("ТекстСообщения + ")) > 0 Тогда
			Возврат Неопределено;
		КонецЕсли;	 
		
		Если Найти(НРег(Стр),НРег("+ ТекстСообщения")) > 0 Тогда
			Возврат Неопределено;
		КонецЕсли;	 
		
		Если Найти(НРег(Стр),НРег("ТекстСообщения = Вычислить(")) > 0 Тогда
			Возврат Неопределено;
		КонецЕсли;	 
		
		Если Найти(НРег(Стр),НРег("ТекстСообщения = Формат")) > 0 Тогда
			Возврат Неопределено;
		КонецЕсли;	 
		
		ПромСтр = СокрЛП(Сред(Стр,61));
		Если Лев(ПромСтр,1) <> """" Тогда
			Возврат Неопределено;
		КонецЕсли;	 
		
		
		Стр = Сред(Стр,61);
		
		Стр = ВыделитьПолезнуюСтроку(Стр);
		Возврат Стр;
	ИначеЕсли Лев(НРег(Стр),17) = НРег("ТекстСообщения = ") Тогда
		Если Найти(НРег(Стр),НРег("СтрЗаменить")) > 0 Тогда
			Возврат Неопределено;
		КонецЕсли;	 
		
		Если Найти(НРег(Стр),НРег("ТекстСообщения + ")) > 0 Тогда
			Возврат Неопределено;
		КонецЕсли;	 
		
		Если Найти(НРег(Стр),НРег("+ ТекстСообщения")) > 0 Тогда
			Возврат Неопределено;
		КонецЕсли;	 
		
		Если Найти(НРег(Стр),НРег("ТекстСообщения = Вычислить(")) > 0 Тогда
			Возврат Неопределено;
		КонецЕсли;	 
		
		Если Найти(НРег(Стр),НРег("ТекстСообщения = Формат")) > 0 Тогда
			Возврат Неопределено;
		КонецЕсли;	 
		
		ПромСтр = СокрЛП(Сред(Стр,17));
		Если Лев(ПромСтр,1) <> """" Тогда
			Возврат Неопределено;
		КонецЕсли;	 
		
		
		Стр = Сред(Стр,18);
		
		Стр = ВыделитьПолезнуюСтроку(Стр);
		Возврат Стр;
	ИначеЕсли Лев(НРег(Стр),17) = НРег("СделатьСообщение(") Тогда
		Если Найти(НРег(Стр),НРег("(ТекстСообщения)")) > 0 Тогда
			Возврат Неопределено;
		ИначеЕсли Найти(НРег(Стр),НРег("(Сообщение)")) > 0 Тогда
			Возврат Неопределено;
		ИначеЕсли Найти(НРег(Стр),НРег("(СтрОшибка)")) > 0 Тогда
			Возврат Неопределено;
		ИначеЕсли Найти(НРег(Стр),НРег("""")) = 0 Тогда
			Возврат Неопределено;
		КонецЕсли;	 
		
		ПромСтр = СокрЛП(Сред(Стр,18));
		Если Лев(ПромСтр,1) <> """" Тогда
			Возврат Неопределено;
		КонецЕсли;	 
		
		
		Стр = СтрЗаменить(Стр,"СделатьСообщение(","");
		Если Прав(Стр,1) = ";" Тогда
			Стр = Лев(Стр,СтрДлина(Стр)-1);
		КонецЕсли;	 
		Если Прав(Стр,1) = ")" Тогда
			Стр = Лев(Стр,СтрДлина(Стр)-1);
		КонецЕсли;	 
		
		Стр = ВыделитьПолезнуюСтроку(Стр);
		
		Возврат Стр;
	ИначеЕсли Лев(НРег(Стр),9) = НРег("Сообщить(") Тогда
		Если Найти(НРег(Стр),НРег("(ТекстСообщения)")) > 0 Тогда
			Возврат Неопределено;
		ИначеЕсли Найти(НРег(Стр),НРег("(Сообщение)")) > 0 Тогда
			Возврат Неопределено;
		ИначеЕсли Найти(НРег(Стр),НРег("(СтрОшибка)")) > 0 Тогда
			Возврат Неопределено;
		ИначеЕсли Найти(НРег(Стр),НРег("""")) = 0 Тогда
			Возврат Неопределено;
		КонецЕсли;	 
		
		ПромСтр = СокрЛП(Сред(Стр,10));
		Если Лев(ПромСтр,1) <> """" Тогда
			Возврат Неопределено;
		КонецЕсли;	 
		
		
		Стр = СтрЗаменить(Стр,"Сообщить(","");
		Если Прав(Стр,1) = ";" Тогда
			Стр = Лев(Стр,СтрДлина(Стр)-1);
		КонецЕсли;	 
		Если Прав(Стр,1) = ")" Тогда
			Стр = Лев(Стр,СтрДлина(Стр)-1);
		КонецЕсли;	 
		
		Стр = ВыделитьПолезнуюСтроку(Стр);
		
		Возврат Стр;
	ИначеЕсли Лев(НРег(Стр),18) = НРег("ВызватьИсключение ") Тогда
		
		
		Если Найти(НРег(Стр),НРег("""")) = 0 Тогда
			Возврат Неопределено;
		КонецЕсли;	 
		
		ПромСтр = СокрЛП(Сред(Стр,18));
		Если Лев(ПромСтр,1) <> """" Тогда
			Возврат Неопределено;
		КонецЕсли;	 
		
		
		Стр = СтрЗаменить(Стр,"ВызватьИсключение","");
		Стр = СокрЛП(Стр);
		
		Если Прав(Стр,1) = ";" Тогда
			Стр = Лев(Стр,СтрДлина(Стр)-1);
		КонецЕсли;	 
		Если Прав(Стр,1) = ")" Тогда
			Стр = Лев(Стр,СтрДлина(Стр)-1);
		КонецЕсли;	 
		
		Стр = ВыделитьПолезнуюСтроку(Стр);
		Возврат Стр;
	КонецЕсли;	 
	
	Возврат Неопределено;
КонецФункции	 

&НаКлиенте
Функция ПроверитьСтрокуНаПравильность(Стр)
	Если Стр = "%1 %2" Тогда
		Возврат Неопределено;
	ИначеЕсли Стр = "%1. %2" Тогда
		Возврат Неопределено;
	ИначеЕсли Стр = "Failed: %1" Тогда
		Возврат Неопределено;
	ИначеЕсли Стр = "Pending: %1" Тогда
		Возврат Неопределено;
	ИначеЕсли Стр = "Sleep:%1" Тогда
		Возврат Неопределено;
	ИначеЕсли Стр = "%1 = %2" Тогда
		Возврат Неопределено;
	ИначеЕсли Стр = "%1.%2" Тогда
		Возврат Неопределено;
	ИначеЕсли Стр = "" Тогда
		Возврат Неопределено;
	ИначеЕсли Стр = " " Тогда
		Возврат Неопределено;
	ИначеЕсли Стр = "ffmpeg - OK" Тогда
		Возврат Неопределено;
	ИначеЕсли Стр = "ImageMagic - OK" Тогда
		Возврат Неопределено;
	ИначеЕсли Стр = "oscript - OK" Тогда
		Возврат Неопределено;
	ИначеЕсли Стр = "VLC 2.1.5 - OK" Тогда
		Возврат Неопределено;
	КонецЕсли;	 
	
	Возврат Стр;
КонецФункции	  

&НаКлиенте
Функция МассивФайловДляОбработки(Каталог)
	МассивФайлов = Новый Массив;
	
	//Добавим библиотеки
	Файлы = НайтиФайлы(Каталог,"*.bsl",Истина);
	Для Каждого Файл Из Файлы Цикл
		
		Если Найти(НРег(Файл.ПолноеИмя),НРег("Libraries")) = 0 Тогда
			Продолжить;
		КонецЕсли;	 
		
		МассивФайлов.Добавить(Файл);
	КонецЦикла;
	
	
	//Добавим ванессу
	Файлы = НайтиФайлы(Каталог + "\VanessaBehavior","*.bsl",Истина);
	Для Каждого Файл Из Файлы Цикл
		МассивФайлов.Добавить(Файл);
	КонецЦикла;
	
	//Добавим либы
	Файлы = НайтиФайлы(Каталог + "\lib","*.bsl",Истина);
	Для Каждого Файл Из Файлы Цикл
		МассивФайлов.Добавить(Файл);
	КонецЦикла;
	
	//Добавим плагины
	Файлы = НайтиФайлы(Каталог + "\\plugins","*.bsl",Истина);
	Для Каждого Файл Из Файлы Цикл
		МассивФайлов.Добавить(Файл);
	КонецЦикла;
	
	Возврат МассивФайлов; 
КонецФункции	 

&НаКлиенте
Процедура НайтиНовыеСообщения(МакетСообщений,Каталог,МассивРезультат)
	МассивУжеЕсть = Новый Массив;
	Для Ккк = 1 По МакетСообщений.ВысотаТаблицы Цикл
		МассивУжеЕсть.Добавить(СокрЛП(НРег(МакетСообщений.Область(Ккк,1,Ккк,1).Текст)));
	КонецЦикла;	
	
	
	МассивФайлов = МассивФайловДляОбработки(Каталог);
	
	Для Каждого Файл Из МассивФайлов Цикл
		Текст = Новый ЧтениеТекста;
		Текст.Открыть(Файл.ПолноеИмя,"UTF-8");
		
		Пока Истина Цикл
			Стр = Текст.ПрочитатьСтроку();
			Если Стр = Неопределено Тогда
				Прервать;
			КонецЕсли;	 
			ИсходнаяСтрока = Стр;
			
			Если Найти(Стр,"Не указано имя файла лога в параметре") > 0 Тогда
				ввап = 1;
			КонецЕсли;	 
			
			Если Найти(Стр,"$") > 0 Тогда
				Продолжить;
			КонецЕсли;	 
			
			
			
			Стр = СокрЛП(Стр);
			
			
			Если Найти(Стр,"Запускаю генерацию epf.") > 0 Тогда
				вава = 1;
			КонецЕсли;	 
			
			СообщениеВСтроке = ПолучитьСообщениеИзСтроки(Стр);
			
			
			СообщениеВСтроке = ПроверитьСтрокуНаПравильность(СообщениеВСтроке);
		
			Если СообщениеВСтроке = Неопределено Тогда
				Продолжить;
			КонецЕсли;	 
			
			Если МассивУжеЕсть.Найти(НРег(СообщениеВСтроке)) = Неопределено Тогда
				//Сообщить("СообщениеВСтроке="+СообщениеВСтроке);
				МассивУжеЕсть.Добавить(НРег(СообщениеВСтроке));
				МассивРезультат.Добавить(СообщениеВСтроке);
			КонецЕсли;	 
			
		КонецЦикла;	
		
		Текст.Закрыть();
		
	КонецЦикла;	
	
КонецПроцедуры 

&НаСервере
Функция ОтсортироватьМассивСервер(Массив)
	Тзн = Новый ТаблицаЗначений;
	Тзн.Колонки.Добавить("Стр");
	
	Для Каждого Стр Из Массив Цикл
		СтрТзн = Тзн.Добавить();
		СтрТзн.Стр = Стр;
	КонецЦикла;	
	
	Тзн.Сортировать("Стр");
	
	
	МассивНовый = Новый Массив;
	Для Каждого СтрТзн Из Тзн Цикл
		МассивНовый.Добавить(СтрТзн.Стр);
	КонецЦикла;	
	
	Возврат МассивНовый;
КонецФункции	 

&НаКлиенте
Процедура ДополнитьМакетСообщений(Команда)
	ПереводСообщений = Неопределено;
	ИмяОбработки = ПодключитьВнешнююОбработкуКлиент(ПутьКОбработке,ПереводСообщений);
	Сообщить("ИмяОбработки="+ИмяОбработки);
	Сообщить("ПереводСообщений="+ПереводСообщений);
	
	
	МассивРезультат = Новый Массив;
	
	
	Файл = Новый Файл(ПутьКОбработке);
	НайтиНовыеСообщения(ПереводСообщений,Файл.Путь,МассивРезультат);
	
	МассивРезультат = ОтсортироватьМассивСервер(МассивРезультат);
	
	ТабДок = Новый ТабличныйДокумент;
	Сч = 0;
	Для Каждого Элем Из МассивРезультат Цикл
		Сч = Сч + 1;
		ТабДок.Область(Сч,1,Сч,1).Текст = Элем;
	КонецЦикла;	
	
	ТабДок.Показать();
	
КонецПроцедуры

&НаКлиенте
Функция ПодключитьВнешнююОбработкуКлиент(ИмяФайла,ПереводСообщений) Экспорт
	ЕстьЗащитаОтОпасныхДействий = Ложь;
	Попытка
		ДополнительныеПараметры = Новый Структура;
		АдресХранилища = "";
		ПоместитьФайл(АдресХранилища, ИмяФайла, , Ложь, УникальныйИдентификатор);
		Результат = Неопределено;
		ИмяОбработки = ПодключитьВнешнююОбработкуСервер(АдресХранилища,ЕстьЗащитаОтОпасныхДействий,ПереводСообщений);
		
		
		Возврат ИмяОбработки;
	
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
КонецФункции 

&НаСервереБезКонтекста
Функция ПодключитьВнешнююОбработкуСервер(АдресХранилища,ИспользуетсяЗащитаОтОпасныхДействий,ПереводСообщений)
	ИмяОбработки = ВнешниеОбработки.Подключить(АдресХранилища, , Ложь); 
	Обработка = ВнешниеОбработки.Создать(ИмяОбработки);
	ПереводСообщений = Обработка.ПолучитьМакет("ПереводСообщений");
	Возврат ИмяОбработки;
КонецФункции 

&НаКлиенте
Процедура ЗаменитьВФайлахСообщениеНаВызовСлужебнойФункции(Команда)
	Файл = Новый Файл(ПутьКОбработке);
	МассивФайлов = МассивФайловДляОбработки(Файл.Путь);
	
	Для Каждого Файл Из МассивФайлов Цикл
		Если Найти(Файл.ПолноеИмя,"CompareFiles") > 0 Тогда
			Продолжить;
		КонецЕсли;	 
		
		Текст = Новый ЧтениеТекста;
		Текст.Открыть(Файл.ПолноеИмя,"UTF-8");
		
		МассивСтрок = Новый Массив;
		
		БылиИзменения = Ложь;
		
		Пока Истина Цикл
			Стр = Текст.ПрочитатьСтроку();
			Если Стр = Неопределено Тогда
				Прервать;
			КонецЕсли;	 
			
			Если Лев(СокрЛП(Стр),2) = "//" Тогда
				МассивСтрок.Добавить(Стр);
				Продолжить;
			ИначеЕсли Найти(Стр,"ДобавитьСтрокуВМодуль") > 0 Тогда
				МассивСтрок.Добавить(Стр);
				Продолжить;
			ИначеЕсли Найти(Стр,"ДобавитьШагВМассивТестов") > 0 Тогда
				МассивСтрок.Добавить(Стр);
				Продолжить;
			КонецЕсли;	 
			
			ИсходнаяСтрока = Стр;
			
			//Если Найти(Стр,"ПолучитьТекстСообщенияПользователю") = 0 Тогда
			//	Стр = СтрЗаменить(Стр,"ВызватьИсключение ТекстСообщения","ВызватьИсключение Ванесса.ПолучитьТекстСообщенияПользователю(ТекстСообщения)");
			//	Стр = СтрЗаменить(Стр,"Сообщить(ТекстСообщения)","Сообщить(Ванесса.ПолучитьТекстСообщенияПользователю(ТекстСообщения))");
			//	Стр = СтрЗаменить(Стр,"Ванесса.ПродолжитьВыполнениеШагов(Истина,ТекстСообщения)","Ванесса.ПродолжитьВыполнениеШагов(Истина,Ванесса.ПолучитьТекстСообщенияПользователю(ТекстСообщения))");
			//КонецЕсли;
			                    
			Если Найти(Стр,"ТекстСообщения = """) > 0 Тогда
				Если (Найти(Файл.ПолноеИмя,"ObjectModule") > 0) или (Найти(Файл.ПолноеИмя,"УправляемаяФорма") > 0) Тогда
					Стр = СтрЗаменить(Стр,"ТекстСообщения = ""","ТекстСообщения = ПолучитьТекстСообщенияПользователю(""");
				Иначе		
					Стр = СтрЗаменить(Стр,"ТекстСообщения = ""","ТекстСообщения = Ванесса.ПолучитьТекстСообщенияПользователю(""");
				КонецЕсли;	 
				Стр = СтрЗаменить(Стр,""";",""");");
			КонецЕсли;	 
			
			Если Найти(Стр,"ВызватьИсключение """) > 0 Тогда
				Если (Найти(Файл.ПолноеИмя,"ObjectModule") > 0) или (Найти(Файл.ПолноеИмя,"УправляемаяФорма") > 0) Тогда
					Стр = СтрЗаменить(Стр,"ВызватьИсключение ""","ВызватьИсключение ПолучитьТекстСообщенияПользователю(""");
				Иначе	
					Стр = СтрЗаменить(Стр,"ВызватьИсключение ""","ВызватьИсключение Ванесса.ПолучитьТекстСообщенияПользователю(""");
				КонецЕсли;	 
				Стр = СтрЗаменить(Стр,""";",""");");
			КонецЕсли;	 
			
			Если Найти(Стр,"ВызватьИсключение """) > 0 Тогда
				Если (Найти(Файл.ПолноеИмя,"ObjectModule") > 0) или (Найти(Файл.ПолноеИмя,"УправляемаяФорма") > 0) Тогда
					Стр = СтрЗаменить(Стр,"ВызватьИсключение ""","ВызватьИсключение ПолучитьТекстСообщенияПользователю(""");
				Иначе	
					Стр = СтрЗаменить(Стр,"ВызватьИсключение ""","ВызватьИсключение Ванесса.ПолучитьТекстСообщенияПользователю(""");
				КонецЕсли;	 
				Стр = СтрЗаменить(Стр,""";",""");");
			КонецЕсли;	 
			
			Если Найти(Стр,"Сообщить(""") > 0 Тогда
				Если (Найти(Файл.ПолноеИмя,"ObjectModule") > 0) или (Найти(Файл.ПолноеИмя,"УправляемаяФорма") > 0) Тогда
					Стр = СтрЗаменить(Стр,"Сообщить(""","Сообщить(ПолучитьТекстСообщенияПользователю(""");
				Иначе	
					Стр = СтрЗаменить(Стр,"Сообщить(""","Сообщить(Ванесса.ПолучитьТекстСообщенияПользователю(""");
				КонецЕсли;	 
				Стр = СтрЗаменить(Стр,""");","""));");
			КонецЕсли;	 
			
			//Стр = СтрЗаменить(Стр,"ВызватьИсключение ПолучитьТекстСообщенияПользователю(ТекстСообщения)","ВызватьИсключение ТекстСообщения");
			//Стр = СтрЗаменить(Стр,"ВызватьИсключение Ванесса.ПолучитьТекстСообщенияПользователю(ТекстСообщения)","ВызватьИсключение ТекстСообщения");
			//Если Найти(Стр,"ВызватьИсключение") > 0 Тогда
			//	БылиИзменения = Истина;
			//КонецЕсли;	 
			
			МассивСтрок.Добавить(Стр);
			
			Если ИсходнаяСтрока <> Стр Тогда
				БылиИзменения = Истина;
			КонецЕсли;	 
			
		КонецЦикла;	
		
		Текст.Закрыть();
		
		
		
		Если НЕ БылиИзменения Тогда
			Продолжить;
		КонецЕсли;	 
		
		
		ВременныйФайл = ПолучитьИмяВременногоФайла("bsl");
		
		ЗТ = Новый ЗаписьТекста(ВременныйФайл,"UTF-8",,Истина); 
		Для Каждого Стр Из МассивСтрок Цикл
			ЗТ.ЗаписатьСтроку(Стр); 
		КонецЦикла;	
		ЗТ.Закрыть();
		
		КопироватьФайл(ВременныйФайл,Файл.ПолноеИмя);
		
		
	КонецЦикла;	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура СортироватьМассивСекцийСервер(МассивСекций)
	Тзн = Новый ТаблицаЗначений;
	Тзн.Колонки.Добавить("СтрокаRU");
	Тзн.Колонки.Добавить("Секция");
	
	Для Каждого Элем Из МассивСекций Цикл
		СтрТзн = Тзн.Добавить();
		СтрТзн.СтрокаRU = Элем.СтрокаRU;
		СтрТзн.Секция   = Элем;
	КонецЦикла;	
	
	Тзн.Сортировать("СтрокаRU");
	
	Массив = Новый Массив;
	Для Каждого СтрТзн Из Тзн Цикл
		Массив.Добавить(СтрТзн.Секция);
	КонецЦикла;	
	
	МассивСекций = 	Массив;
КонецПроцедуры 

&НаКлиенте
Функция ВывестиСтрокуИзXML(Знач Стр)
	Стр = СтрЗаменить(Стр,"&lt;","<");
	Стр = СтрЗаменить(Стр,"&gt;",">");
	Возврат Стр;
КонецФункции	 

&НаКлиенте
Функция ВернутьСтрокуВXML(Знач Стр)
	Стр = СтрЗаменить(Стр,"<","&lt;");
	Стр = СтрЗаменить(Стр,">","&gt;");
	Возврат Стр;
КонецФункции	 

&НаКлиенте
Процедура ПроверитьСтрокуНаКорректность(Стр)
	Стр = СтрЗаменить(Стр,"% 1","%1");
	Стр = СтрЗаменить(Стр,"% 2","%2");
	Стр = СтрЗаменить(Стр,"% 3","%3");
	Стр = СтрЗаменить(Стр,"% 4","%4");
	Стр = СтрЗаменить(Стр,"% 5","%5");
	Стр = СтрЗаменить(Стр,"% 6","%6");
	Стр = СтрЗаменить(Стр,"% 7","%7");
	
	
	Поз1 = Найти(Стр,"%1");
	Поз2 = Найти(Стр,"%2");
	Поз3 = Найти(Стр,"%3");
	Поз4 = Найти(Стр,"%4");
	Поз5 = Найти(Стр,"%5");
	Поз6 = Найти(Стр,"%6");
	Поз7 = Найти(Стр,"%7");
	
	Если Поз1 > 0 и Поз2 > 0 Тогда
		Если Поз2 < Поз1 Тогда
			Сообщить("Ошибка в строке1: " + ВывестиСтрокуИзXML(Стр));
		КонецЕсли;	 
	КонецЕсли;	 
	
	Если Поз2 > 0 и Поз3 > 0 Тогда
		Если Поз3 < Поз2 Тогда
			Сообщить("Ошибка в строке2: " + ВывестиСтрокуИзXML(Стр));
		КонецЕсли;	 
		
		Если Поз1 = 0 Тогда
			Сообщить("Ошибка в строке2: " + ВывестиСтрокуИзXML(Стр));
		КонецЕсли;	 
	КонецЕсли;	 
	
	Если Поз3 > 0 и Поз4 > 0 Тогда
		Если Поз4 < Поз3 Тогда
			Сообщить("Ошибка в строке3: " + ВывестиСтрокуИзXML(Стр));
		КонецЕсли;	 
		
		Если Поз1 = 0 Тогда
			Сообщить("Ошибка в строке2: " + ВывестиСтрокуИзXML(Стр));
		ИначеЕсли Поз2 = 0 Тогда
			Сообщить("Ошибка в строке2: " + ВывестиСтрокуИзXML(Стр));
		КонецЕсли;	 
	КонецЕсли;	 
	
	Если Поз4 > 0 и Поз5 > 0 Тогда
		Если Поз5 < Поз4 Тогда
			Сообщить("Ошибка в строке4: " + ВывестиСтрокуИзXML(Стр));
		КонецЕсли;	 
		
		Если Поз1 = 0 Тогда
			Сообщить("Ошибка в строке2: " + ВывестиСтрокуИзXML(Стр));
		ИначеЕсли Поз2 = 0 Тогда
			Сообщить("Ошибка в строке2: " + ВывестиСтрокуИзXML(Стр));
		ИначеЕсли Поз3 = 0 Тогда
			Сообщить("Ошибка в строке2: " + ВывестиСтрокуИзXML(Стр));
		КонецЕсли;	 
	КонецЕсли;	 
	
	Если Поз5 > 0 и Поз6 > 0 Тогда
		Если Поз6 < Поз5 Тогда
			Сообщить("Ошибка в строке5: " + ВывестиСтрокуИзXML(Стр));
		КонецЕсли;	 
		
		Если Поз1 = 0 Тогда
			Сообщить("Ошибка в строке2: " + ВывестиСтрокуИзXML(Стр));
		ИначеЕсли Поз2 = 0 Тогда
			Сообщить("Ошибка в строке2: " + ВывестиСтрокуИзXML(Стр));
		ИначеЕсли Поз3 = 0 Тогда
			Сообщить("Ошибка в строке2: " + ВывестиСтрокуИзXML(Стр));
		ИначеЕсли Поз4 = 0 Тогда
			Сообщить("Ошибка в строке2: " + ВывестиСтрокуИзXML(Стр));
		КонецЕсли;	 
	КонецЕсли;	 
	
КонецПроцедуры 

&НаКлиенте
Процедура СортировкаМакетаСообщенийПоАлфавиту(Команда)
	Файл = Новый Файл(ПутьКОбработке);
	Файлы = НайтиФайлы(Файл.Путь + "\locales\Messages\Templates","*.xml",Истина);
	Для Каждого Файл Из Файлы Цикл
		Текст = Новый ЧтениеТекста;
		Текст.Открыть(Файл.ПолноеИмя,"UTF-8");
		
		МассивСтрокМакета = Новый Массив;
		Пока Истина Цикл
			Стр = Текст.ПрочитатьСтроку();
			Если Стр = Неопределено Тогда
				Прервать;
			КонецЕсли;	 
			
			МассивСтрокМакета.Добавить(Стр);
		КонецЦикла;	
		Текст.Закрыть();
		
		Если Не ЭтоМакетПереводаСообщений(МассивСтрокМакета) Тогда
			Продолжить;
		КонецЕсли;	 
		
		
		НовыйМассив = Новый Массив;
		
		Сч = -1;
		Для Каждого Стр Из МассивСтрокМакета Цикл
			Сч = Сч + 1;
			
			НовыйМассив.Добавить(Стр);
			//добавили шапку и первую строку макета
			
			Если СокрЛП(Стр) = "</rowsItem>" Тогда
				Прервать;
			КонецЕсли;	
		КонецЦикла;	
		
		НомерСтрокиМакета = Сч;
		Счетчик_tl = 0;
		
		Секция = Неопределено;
		МассивСекций = Новый Массив;
		Для Ккк = (НомерСтрокиМакета + 1) По МассивСтрокМакета.Количество()-1 Цикл
			Стр = МассивСтрокМакета.Получить(Ккк);
			Сч  = Ккк;
			
			Если Найти(Стр,"<tl>") > 0 Тогда
				Счетчик_tl = Счетчик_tl + 1;
			КонецЕсли;	 
			
			Если Секция = Неопределено Тогда
				Секция = Новый Структура;
				Секция.Вставить("МассивСтрок",Новый Массив);
				Секция.Вставить("СтрокаRU","");
				Секция.Вставить("СтрокаEN","");
			КонецЕсли;	 
			
			Секция.МассивСтрок.Добавить(Стр);
			
			Если (Найти(Стр,"<v8:lang>") > 0) и (Счетчик_tl = 1) Тогда
				СледующаяСтрока = МассивСтрокМакета.Получить(Ккк+1);
				СледующаяСтрока = СтрЗаменить(СледующаяСтрока,"<v8:content>","");
				СледующаяСтрока = СтрЗаменить(СледующаяСтрока,"</v8:content>","");
				ПроверитьСтрокуНаКорректность(СледующаяСтрока);
				Секция.СтрокаRU = СокрЛП(СледующаяСтрока);
			ИначеЕсли (Найти(Стр,"<v8:lang>") > 0) и (Счетчик_tl = 2) Тогда
				СледующаяСтрока = МассивСтрокМакета.Получить(Ккк+1);
				СледующаяСтрока = СтрЗаменить(СледующаяСтрока,"<v8:content>","");
				СледующаяСтрока = СтрЗаменить(СледующаяСтрока,"</v8:content>","");
				ПроверитьСтрокуНаКорректность(СледующаяСтрока);
				Секция.СтрокаEN = СокрЛП(СледующаяСтрока);
			КонецЕсли;	 
			
			Если СокрЛП(Стр) = "</rowsItem>" Тогда
				МассивСекций.Добавить(Секция);
				Секция = Неопределено;
				Счетчик_tl = 0;
			КонецЕсли;	 
			
			Если СокрЛП(Стр) = "<templateMode>true</templateMode>" Тогда
				Прервать;
			КонецЕсли;	 
		КонецЦикла;	
		
		НомерСтрокиМакета = Сч-1;
		//вычтем 1, чтобы попала строка "<templateMode>true</templateMode>"
		
		
		СортироватьМассивСекцийСервер(МассивСекций);
		
		СчетчикСтрок = 0;
		Для Каждого Элем Из МассивСекций Цикл
			СчетчикСтрок = СчетчикСтрок + 1;
			Для Каждого Стр Из Элем.МассивСтрок Цикл
				Если (Найти(Стр,"<index>") > 0) и (Найти(Стр,"</index>") > 0) Тогда
					Поз = Найти(Стр,"<index>");
					Стр = Лев(Стр,Поз + 7 - 1);
					Стр = Стр + XMLСтрока(СчетчикСтрок) + "</index>";
				КонецЕсли;	 
				НовыйМассив.Добавить(Стр);
			КонецЦикла;	
		КонецЦикла;	
		
		
		//добавим подвал
		Для Ккк = (НомерСтрокиМакета + 1) По МассивСтрокМакета.Количество()-1 Цикл
			Стр = МассивСтрокМакета.Получить(Ккк);
			НовыйМассив.Добавить(Стр);
		КонецЦикла;		
		
		
		ИмяВременногоXML = ПолучитьИмяВременногоФайла("xml");
		
		ЗТ = Новый ЗаписьТекста(ИмяВременногоXML,"UTF-8",,Истина); 
		
		Для Каждого Стр Из НовыйМассив Цикл
			ЗТ.ЗаписатьСтроку(Стр); 
		КонецЦикла;	
		
		ЗТ.Закрыть();
		
		КопироватьФайл(ИмяВременногоXML,Файл.ПолноеИмя);
		
	КонецЦикла;	
	
	
	
КонецПроцедуры


&НаКлиенте
Процедура ПеревестиМакетыСообщений(Команда)
	Файл = Новый Файл(ПутьКОбработке);
	МассивФайлов = НайтиФайлы(Файл.Путь + "\locales\Messages\Templates","*.xml",Ложь);
	
	
	Для Каждого Файл Из МассивФайлов Цикл
		ЯзыкДляПеревода = Файл.ИмяБезРасширения;
		
		Текст = Новый ЧтениеТекста;
		НовыйПуть = Файл.Путь + "\" + Файл.ИмяБезРасширения + "\Ext\Template.xml";
		
		Текст.Открыть(НовыйПуть,"UTF-8");
		
		
		Массив      = Новый Массив;
		НовыйМассив = Новый Массив;
		Пока Истина Цикл
			Стр = Текст.ПрочитатьСтроку();
			Если Стр = Неопределено Тогда
				Прервать;
			КонецЕсли;	 
			
			Массив.Добавить(Стр);
		КонецЦикла;	
		Текст.Закрыть();
		
		
		НашлиСекцию1 = Ложь;
		НомСтр = -1;
		Для Ккк = 0 По Массив.Количество()-1 Цикл
			НомСтр = НомСтр + 1;
			
			Стр = Массив.Получить(Ккк);
			НовыйМассив.Добавить(Стр);
			
			Если Найти(Стр,"</columns>") > 0 Тогда
				НашлиСекцию1 = Истина;
			ИначеЕсли НашлиСекцию1 и Найти(Стр,"<index>1</index>") > 0 Тогда
				Прервать;
			КонецЕсли;	 
		КонецЦикла;	
		
		
		
		
		
		ЗначениеДляПеревода = "";
		СчетчикЗначений     = 0;
		Для Ккк = НомСтр+1 По Массив.Количество()-1 Цикл
			Стр = Массив.Получить(Ккк);
			
			Если СокрЛП(Стр) = "<row>" Тогда
				ЗначениеДляПеревода = "";
				СчетчикЗначений     = 0;
			ИначеЕсли СокрЛП(Стр) = "<tl>" Тогда
				СчетчикЗначений = СчетчикЗначений + 1;
			ИначеЕсли Найти(Стр,"<v8:content>") > 0 Тогда
				Если СчетчикЗначений = 1 Тогда
					ЗначениеДляПеревода = СтрЗаменить(Стр,"<v8:content>","");
					ЗначениеДляПеревода = СтрЗаменить(ЗначениеДляПеревода,"</v8:content>","");
					ЗначениеДляПеревода = СокрЛП(ЗначениеДляПеревода);
					ЗначениеДляПеревода = ВывестиСтрокуИзXML(ЗначениеДляПеревода);
				ИначеЕсли СчетчикЗначений = 2 Тогда
					ПромСтр = СтрЗаменить(Стр,"<v8:content>","");
					ПромСтр = СтрЗаменить(ПромСтр,"</v8:content>","");
					ПромСтр = СокрЛП(ПромСтр);
					Если ПромСтр = "111" Тогда
						//значит надо перевести
						Перевод = ПеревестиВыражение(ЗначениеДляПеревода,"ru",ЯзыкДляПеревода);
						Перевод = СокрЛП(Перевод);
						Сообщить("ЗначениеДляПеревода="+ЗначениеДляПеревода + ", Перевод="+Перевод);
						Перевод = ВернутьСтрокуВXML(Перевод);
						
						Стр = "							<v8:content>" + Перевод + "</v8:content>";
					КонецЕсли;	 
				КонецЕсли;	 
			КонецЕсли;	
			
			НовыйМассив.Добавить(Стр);
		КонецЦикла;	
		
		
		ВременныйФайл = ПолучитьИмяВременногоФайла("xml");
		
		
		ЗТ = Новый ЗаписьТекста(ВременныйФайл,"UTF-8",,Истина); 
		Для Каждого Стр Из НовыйМассив Цикл
			ЗТ.ЗаписатьСтроку(Стр); 
		КонецЦикла;	
		ЗТ.Закрыть();
		
		КопироватьФайл(ВременныйФайл,НовыйПуть);
	КонецЦикла;	
	
КонецПроцедуры

Функция ЭтоМакетПереводаСообщений(Массив)
	НашлиСтроку = Ложь;
	Для Каждого Стр Из Массив Цикл
		Если Найти(Стр,"<rowsItem>") > 0 Тогда
			НашлиСтроку = Истина;
			Прервать;
		КонецЕсли;	 
	КонецЦикла;	
	
	Возврат НашлиСтроку; 
КонецФункции	 

&НаКлиенте
Процедура ВставитьВМакетыПереводовСообщенийСтроку(Команда)
	Файл = Новый Файл(ПутьКОбработке);
	
	Файлы = НайтиФайлы(Файл.Путь + "\locales\Messages\Templates","*.xml",Истина);
	Для Каждого Файл Из Файлы Цикл
		Текст = Новый ЧтениеТекста;
		Текст.Открыть(Файл.ПолноеИмя,"UTF-8");
		
		Массив = Новый Массив;
		Пока Истина Цикл
			Стр = Текст.ПрочитатьСтроку();
			Если Стр = Неопределено Тогда
				Прервать;
			КонецЕсли;	 
			
			Массив.Добавить(Стр);
		КонецЦикла;	
		Текст.Закрыть();
		
		Если Не ЭтоМакетПереводаСообщений(Массив) Тогда
			Продолжить;
		КонецЕсли;	 
		
		
		Сообщить(Файл.ПолноеИмя);
		
		КоличествоСтрокМакета = 0;
		ИдСтрокиМассива = -1;
		
		Сч = -1;
		Для Каждого Стр Из Массив Цикл
			Сч = Сч + 1;
			Если Найти(Стр,"</index>") > 0 Тогда
				Стр = СтрЗаменить(Стр,"</index>","");
				Стр = СтрЗаменить(Стр,"<index>","");
				Стр = XMLСтрока(СокрЛП(Стр));
				ПромЧисло = Число(Стр);
				
				Если КоличествоСтрокМакета < ПромЧисло Тогда
					КоличествоСтрокМакета = ПромЧисло;
					ИдСтрокиМассива       = Сч;
				КонецЕсли;	 
			КонецЕсли;	 
		КонецЦикла;	
		Сообщить("КоличествоСтрокМакета="+КоличествоСтрокМакета);
		
		
		РазмерСекции = 27;
		
		ИдСтрокиМассива = ИдСтрокиМассива - 1;
		//это строка "	<rowsItem>"
		
		Секция = Новый Массив;
		Для Ккк = 1 По РазмерСекции Цикл
			ИдСтроки = ИдСтрокиМассива + Ккк  -1;
			Стр      = Массив.Получить(ИдСтроки);
			Секция.Добавить(Стр);
		КонецЦикла;	
		
		Если Найти(Секция[РазмерСекции-1],"</rowsItem>") = 0 Тогда
			//Сообщить(Файл.ПолноеИмя + ", Ошибка при чтении строки макета в исходниках.");
			//Продолжить;
			
			ВызватьИсключение "Ошибка при чтении строки макета в исходниках.";
		КонецЕсли;	 
		
		ИдСтрокиМассива = ИдСтрокиМассива + РазмерСекции;
		
		НовыйМассив = Новый Массив;
		Для Ккк = 0 По ИдСтрокиМассива-1 Цикл
			Стр = Массив.Получить(Ккк);
			НовыйМассив.Добавить(Стр);
		КонецЦикла;	
		
		
		МассивЗначенийДляВставки = СтрРазделить(СтрокаДляВставкиВМакет,Символы.ПС);
		Если СокрЛП(МассивЗначенийДляВставки[МассивЗначенийДляВставки.Количество()-1]) = "" Тогда
			МассивЗначенийДляВставки.Удалить(МассивЗначенийДляВставки.Количество()-1);
		КонецЕсли;	 
		
		Для НомерВставляемойСтроки = 1 По МассивЗначенийДляВставки.Количество() Цикл
			ЗначениеДляВставки = СокрЛП(МассивЗначенийДляВставки[НомерВставляемойСтроки-1]);
			Счетчик_tl = 0;
			Для Каждого Стр Из Секция Цикл
				Если Найти(Стр,"</index>") > 0 Тогда
					Стр = "		<index>" + XMLСтрока(КоличествоСтрокМакета+НомерВставляемойСтроки) + "</index>";
				ИначеЕсли Найти(Стр,"<tl>") > 0 Тогда
					Счетчик_tl = Счетчик_tl + 1;
				ИначеЕсли (Найти(Стр,"<v8:content>") > 0) и (Счетчик_tl = 1) Тогда
					Стр = "							<v8:content>" + ВернутьСтрокуВXML(ЗначениеДляВставки) + "</v8:content>";
					
				ИначеЕсли (Найти(Стр,"<v8:content>") > 0) и (Счетчик_tl = 2) Тогда
					Стр = "							<v8:content>Translation not found</v8:content>";
				КонецЕсли;	 
				
				НовыйМассив.Добавить(Стр);
			КонецЦикла;	
		КонецЦикла;	
		
		КоличествоЗначенийДляВставки = МассивЗначенийДляВставки.Количество();
		
		//подвал
		Для Ккк = ИдСтрокиМассива По Массив.Количество()-1 Цикл
			Стр = Массив.Получить(Ккк);
			Если Найти(Стр,"<height>" + XMLСтрока(КоличествоСтрокМакета+1) + "</height>") > 0 Тогда
				Стр = "	<height>" + XMLСтрока(КоличествоСтрокМакета+КоличествоЗначенийДляВставки+1) + "</height>";
			ИначеЕсли Найти(Стр,"<vgRows>" + XMLСтрока(КоличествоСтрокМакета+1) + "</vgRows>") > 0 Тогда
				Стр = "	<vgRows>" + XMLСтрока(КоличествоСтрокМакета+КоличествоЗначенийДляВставки+1) + "</vgRows>";
			КонецЕсли;	 
			
			НовыйМассив.Добавить(Стр);
		КонецЦикла;	
		
		
		ВременныйФайл = ПолучитьИмяВременногоФайла("xml");
		ЗТ = Новый ЗаписьТекста(ВременныйФайл,"UTF-8",,Истина); 
		Для Каждого Стр Из НовыйМассив Цикл
			ЗТ.ЗаписатьСтроку(Стр); 
		КонецЦикла;	
		ЗТ.Закрыть();
		
		КопироватьФайл(ВременныйФайл,Файл.ПолноеИмя);
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьСтрокуВМакетахИВКоде(Команда)
	Файл = Новый Файл(ПутьКОбработке);
	
	СтрокаИсходникМакет = ВернутьСтрокуВXML(СтрокаИсходник);
	СтрокаЗаменыМакет   = ВернутьСтрокуВXML(СтрокаЗамены);
	
	Файлы = НайтиФайлы(Файл.Путь + "\locales\Messages\Templates","*.xml",Истина);
	Для Каждого Файл Из Файлы Цикл
		Текст = Новый ЧтениеТекста;
		Текст.Открыть(Файл.ПолноеИмя,"UTF-8");
		
		Массив = Новый Массив;
		Пока Истина Цикл
			Стр = Текст.ПрочитатьСтроку();
			Если Стр = Неопределено Тогда
				Прервать;
			КонецЕсли;	 
			
			Массив.Добавить(Стр);
		КонецЦикла;	
		Текст.Закрыть();
		
		Если Не ЭтоМакетПереводаСообщений(Массив) Тогда
			Продолжить;
		КонецЕсли;	 
		
		
		Сообщить(Файл.ПолноеИмя);
		
		КоличествоСтрокМакета = 0;
		ИдСтрокиМассива = -1;
		
		НашлиСтрокуВМакете = Ложь;
		Сч = -1;
		Для Каждого Стр Из Массив Цикл
			КоличествоСтрокМакета = КоличествоСтрокМакета + 1;
			Сч = Сч + 1;
			Если Найти(Стр,"<v8:content>") > 0 Тогда
				Стр = СтрЗаменить(Стр,"<v8:content>","");
				Стр = СтрЗаменить(Стр,"</v8:content>","");
				Стр = СокрЛП(Стр);
				
				//Если Найти(Стр,", а оно должно было быть.") > 0 Тогда
				//	вава = 1;
				//КонецЕсли;	 
				
				Если Стр = СтрокаИсходникМакет Тогда
					НашлиСтрокуВМакете = Истина;
					Массив[Сч] = "							<v8:content>" + СтрокаЗаменыМакет + "</v8:content>";
				КонецЕсли;	 
			КонецЕсли;	 
		КонецЦикла;	
		//Сообщить("КоличествоСтрокМакета="+КоличествоСтрокМакета);
		
		
		Если НЕ НашлиСтрокуВМакете Тогда
			ВызватьИсключение "Не нашли строку <" + СтрокаИсходник + "> в макете <" + Файл.ПолноеИмя + ">";
		КонецЕсли;	 
		
		ВременныйФайл = ПолучитьИмяВременногоФайла("xml");
		ЗТ = Новый ЗаписьТекста(ВременныйФайл,"UTF-8",,Истина); 
		Для Каждого Стр Из Массив Цикл
			ЗТ.ЗаписатьСтроку(Стр); 
		КонецЦикла;	
		ЗТ.Закрыть();
		
		КопироватьФайл(ВременныйФайл,Файл.ПолноеИмя);
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Функция ПрочитатьОбъектJSON(ДанныеJSON, ПрочитатьВСоответствие = Ложь) Экспорт
	#Если НЕ ВебКлиент Тогда

	ЧтениеJSON = New ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ДанныеJSON);
	Значение = ПрочитатьJSON(ЧтениеJSON, ПрочитатьВСоответствие);
	ЧтениеJSON.Закрыть();
	Возврат Значение;
	
	#КонецЕсли
КонецФункции

&НаКлиенте
Процедура ВставитьВМакетыСтрокиИзМассиваJson(Команда)
	Файл = Новый Файл(ПутьКОбработке);
	
	Файлы = НайтиФайлы(Файл.Путь + "\locales\Messages\Templates","*.xml",Истина);
	Для Каждого Файл Из Файлы Цикл
		Текст = Новый ЧтениеТекста;
		Текст.Открыть(Файл.ПолноеИмя,"UTF-8");
		
		Массив = Новый Массив;
		Пока Истина Цикл
			Стр = Текст.ПрочитатьСтроку();
			Если Стр = Неопределено Тогда
				Прервать;
			КонецЕсли;	 
			
			Массив.Добавить(Стр);
		КонецЦикла;	
		Текст.Закрыть();
		
		Если Не ЭтоМакетПереводаСообщений(Массив) Тогда
			Продолжить;
		КонецЕсли;	 
		
		
		Сообщить(Файл.ПолноеИмя);
		
		КоличествоСтрокМакета = 0;
		ИдСтрокиМассива = -1;
		
		Сч = -1;
		Для Каждого Стр Из Массив Цикл
			Сч = Сч + 1;
			Если Найти(Стр,"</index>") > 0 Тогда
				Стр = СтрЗаменить(Стр,"</index>","");
				Стр = СтрЗаменить(Стр,"<index>","");
				Стр = XMLСтрока(СокрЛП(Стр));
				ПромЧисло = Число(Стр);
				
				Если КоличествоСтрокМакета < ПромЧисло Тогда
					КоличествоСтрокМакета = ПромЧисло;
					ИдСтрокиМассива       = Сч;
				КонецЕсли;	 
			КонецЕсли;	 
		КонецЦикла;	
		Сообщить("КоличествоСтрокМакета="+КоличествоСтрокМакета);
		
		
		РазмерСекции = 27;
		
		ИдСтрокиМассива = ИдСтрокиМассива - 1;
		//это строка "	<rowsItem>"
		
		Секция = Новый Массив;
		Для Ккк = 1 По РазмерСекции Цикл
			ИдСтроки = ИдСтрокиМассива + Ккк  -1;
			Стр      = Массив.Получить(ИдСтроки);
			Секция.Добавить(Стр);
		КонецЦикла;	
		
		Если Найти(Секция[РазмерСекции-1],"</rowsItem>") = 0 Тогда
			//Сообщить(Файл.ПолноеИмя + ", Ошибка при чтении строки макета в исходниках.");
			//Продолжить;
			
			ВызватьИсключение "Ошибка при чтении строки макета в исходниках.";
		КонецЕсли;	 
		
		ИдСтрокиМассива = ИдСтрокиМассива + РазмерСекции;
		
		НовыйМассив = Новый Массив;
		Для Ккк = 0 По ИдСтрокиМассива-1 Цикл
			Стр = Массив.Получить(Ккк);
			НовыйМассив.Добавить(Стр);
		КонецЦикла;	
		
		МассивЗначенийДляВставки = ПрочитатьОбъектJSON(СтрокаДляВставкиВМакет);
		Если СокрЛП(МассивЗначенийДляВставки[МассивЗначенийДляВставки.Количество()-1]) = "" Тогда
			МассивЗначенийДляВставки.Удалить(МассивЗначенийДляВставки.Количество()-1);
		КонецЕсли;	 
		
		Для НомерВставляемойСтроки = 1 По МассивЗначенийДляВставки.Количество() Цикл
			ЗначениеДляВставки = СокрЛП(МассивЗначенийДляВставки[НомерВставляемойСтроки-1]);
			Счетчик_tl = 0;
			Для Каждого Стр Из Секция Цикл
				Если Найти(Стр,"</index>") > 0 Тогда
					Стр = "		<index>" + XMLСтрока(КоличествоСтрокМакета+НомерВставляемойСтроки) + "</index>";
				ИначеЕсли Найти(Стр,"<tl>") > 0 Тогда
					Счетчик_tl = Счетчик_tl + 1;
				ИначеЕсли (Найти(Стр,"<v8:content>") > 0) и (Счетчик_tl = 1) Тогда
					Стр = "							<v8:content>" + ВернутьСтрокуВXML(ЗначениеДляВставки) + "</v8:content>";
					
				ИначеЕсли (Найти(Стр,"<v8:content>") > 0) и (Счетчик_tl = 2) Тогда
					Стр = "							<v8:content>Translation not found</v8:content>";
				КонецЕсли;	 
				
				НовыйМассив.Добавить(Стр);
			КонецЦикла;	
		КонецЦикла;	
		
		КоличествоЗначенийДляВставки = МассивЗначенийДляВставки.Количество();
		
		//подвал
		Для Ккк = ИдСтрокиМассива По Массив.Количество()-1 Цикл
			Стр = Массив.Получить(Ккк);
			Если Найти(Стр,"<height>" + XMLСтрока(КоличествоСтрокМакета+1) + "</height>") > 0 Тогда
				Стр = "	<height>" + XMLСтрока(КоличествоСтрокМакета+КоличествоЗначенийДляВставки+1) + "</height>";
			ИначеЕсли Найти(Стр,"<vgRows>" + XMLСтрока(КоличествоСтрокМакета+1) + "</vgRows>") > 0 Тогда
				Стр = "	<vgRows>" + XMLСтрока(КоличествоСтрокМакета+КоличествоЗначенийДляВставки+1) + "</vgRows>";
			КонецЕсли;	 
			
			НовыйМассив.Добавить(Стр);
		КонецЦикла;	
		
		
		ВременныйФайл = ПолучитьИмяВременногоФайла("xml");
		ЗТ = Новый ЗаписьТекста(ВременныйФайл,"UTF-8",,Истина); 
		Для Каждого Стр Из НовыйМассив Цикл
			ЗТ.ЗаписатьСтроку(Стр); 
		КонецЦикла;	
		ЗТ.Закрыть();
		
		КопироватьФайл(ВременныйФайл,Файл.ПолноеИмя);
	КонецЦикла;
	
КонецПроцедуры

